// Find: `(\d{4})/(\d{1,2})/(\d{1,2}),(.+)`
// Replace: `new Date($1, $2 - 1, $3), // ($4)`

const japaneseHolidays = [
  new Date(2022, 7 - 1, 18), // (海の日)
  new Date(2022, 8 - 1, 11), // (山の日)
  new Date(2022, 9 - 1, 19), // (敬老の日)
  new Date(2022, 9 - 1, 23), // (秋分の日)
  new Date(2022, 10 - 1, 10), // (スポーツの日)
  new Date(2022, 11 - 1, 3), // (文化の日)
  new Date(2022, 11 - 1, 23), // (勤労感謝の日)
  new Date(2023, 1 - 1, 1), // (元日)
  new Date(2023, 1 - 1, 2), // (休日)
  new Date(2023, 1 - 1, 9), // (成人の日)
  new Date(2023, 2 - 1, 11), // (建国記念の日)
  new Date(2023, 2 - 1, 23), // (天皇誕生日)
  new Date(2023, 3 - 1, 21), // (春分の日)
  new Date(2023, 4 - 1, 29), // (昭和の日)
  new Date(2023, 5 - 1, 3), // (憲法記念日)
  new Date(2023, 5 - 1, 4), // (みどりの日)
  new Date(2023, 5 - 1, 5), // (こどもの日)
  new Date(2023, 7 - 1, 17), // (海の日)
  new Date(2023, 8 - 1, 11), // (山の日)
  new Date(2023, 9 - 1, 18), // (敬老の日)
  new Date(2023, 9 - 1, 23), // (秋分の日)
  new Date(2023, 10 - 1, 9), // (スポーツの日)
  new Date(2023, 11 - 1, 3), // (文化の日)
  new Date(2023, 11 - 1, 23), // (勤労感謝の日)
];

export default japaneseHolidays;
